src/main/resources/getDetail.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tec="http://www.tecalliance.services/pegasus-3-0">
    <soapenv:Header/>
    <soapenv:Body>
        <tec:getArticles>
            <tec:articleCountry>CZ</tec:articleCountry>
            <tec:lang>CS</tec:lang>
            <tec:provider>24019</tec:provider>
            <tec:includeAll>true</tec:includeAll>
            <tec:perPage>100</tec:perPage>
            <tec:page>1</tec:page>
            <tec:searchQuery>${searchQuery}</tec:searchQuery>
            <tec:dataSupplierIds>${dataSupplierIds}</tec:dataSupplierIds>
            <tec:searchType>10</tec:searchType>
        </tec:getArticles>
    </soapenv:Body>
</soapenv:Envelope>